Configure RIP in a diamond configuration with 3 routers and 6 LAN's

Router 1
RIP
192.168.1.0
192.168.2.0
10.0.0.0
12.0.0.0


Router 2
RIP
192.168.3.0
192.168.4.0
10.0.0.0
11.0.0.0

Router 3
RIP
192.168.5.0
192.168.6.0
11.0.0.0
12.0.0.0

Configure OSPF with 2 Routers and 2 LAN's

Router 1

Would you like to enter the initial configuration dialog? [yes/no]: n
Press RETURN to get started!
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int f0/1
Router(config-if)#ip add 192.168.1.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

Router(config-if)#int f0/0
Router(config-if)#ip add 200.1.1.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

Router(config-if)#route ospf 1
Router(config-router)#network 192.168.1.0 0.0.0.255 area 0
Router(config-router)#network 200.1.1.0 0.0.0.255 area 0
Router(config-router)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#wr
Building configuration...
[OK]

Router#sh ip protocols

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set 
  Incoming update filter list for all interfaces is not set 
  Router ID 200.1.1.1
  Number of areas in this router is 1. 1 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    192.168.1.0 0.0.0.255 area 0
    200.1.1.0 0.0.0.255 area 0
  Routing Information Sources:  
    Gateway         Distance      Last Update 
    200.1.1.1            110      00:01:23
    200.1.1.2            110      00:01:23
  Distance: (default is 110)

Router#sh ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.1.0/24 is directly connected, FastEthernet0/1
O    192.168.2.0/24 [110/2] via 200.1.1.2, 00:02:09, FastEthernet0/0
C    200.1.1.0/24 is directly connected, FastEthernet0/0

Router#sh ip ospf database
            OSPF Router with ID (200.1.1.1) (Process ID 1)

                Router Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum Link count
200.1.1.1       200.1.1.1       179         0x80000003 0x0001a7 2
200.1.1.2       200.1.1.2       179         0x80000003 0x001490 2

                Net Link States (Area 0)
Link ID         ADV Router      Age         Seq#       Checksum
200.1.1.1       200.1.1.1       179         0x80000001 0x009228
Router#sh ip ospf neighbor


Neighbor ID     Pri   State           Dead Time   Address         Interface
200.1.1.2         1   FULL/BDR        00:00:34    200.1.1.2       FastEthernet0/0

Router 2

Would you like to enter the initial configuration dialog? [yes/no]: n
Press RETURN to get started!
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int f0/1
Router(config-if)#ip add 192.168.2.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

Router(config-if)#int f0/0
Router(config-if)#ip add 200.1.1.2 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config)#route ospf 1
Router(config-router)#network 192.168.2.0 0.0.0.255 area 0
Router(config-router)#network 200.1.1.0 0.0.0.255 area 0
Router(config-router)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#wr
Building configuration...
[OK]

sh ip protocols

sh ip route

sh ip ospf database

sh ip ospf neighbor





